-- Добавляем клиентов
INSERT INTO Clients (name, contact_info) VALUES
('Герасимов Артур Маркович', 'artur@email.com'),
('Старостин Адам Дмитриевич', 'adamsss@email.com'),
('Козлова Татьяна Антоновна', 'tatya@email.com'),
('Краснова Ольга Кирилловна', 'olga22@email.com');

-- Добавляем счета
INSERT INTO Accounts (client_id, account_number, balance) VALUES
(1, '5435367875', 15000.00),
(2, '5434567243', 5000.00),
(3, '5657735234', 77000.00),
(4, '5667673456', 1000.00);

-- Добавляем транзакции
INSERT INTO Transactions (account_id, transaction_date, amount, transaction_type) VALUES
(1, '2023-10-01', 1000.00, 'пополнение'),
(1, '2023-10-02', 500.00, 'списание'),
(2, '2023-10-01', 2000.00, 'пополнение'),
(2, '2023-10-03', 1000.00, 'списание'),
(3, '2023-10-01', 111000.00, 'пополнение'),
(3, '2023-10-02', 25000.00, 'списание'),
(4, '2023-10-01', 10000.00, 'пополнение'),
(4, '2023-10-02', 5100.00, 'списание');